artifacts/oscar_e2e/fig4_right_qwen3_8b_replay/oscar_int2/in100000_bs8/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31001, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=8, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=100000, random_output_len=1000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=8, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31001, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='Qwen/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=8, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=100000, random_output_len=1000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=8, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 800000
#Output tokens: 8000
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 8         
Successful requests:                     8         
Benchmark duration (s):                  32.94     
Total input tokens:                      800000    
Total input text tokens:                 800000    
Total generated tokens:                  8000      
Total generated tokens (retokenized):    7999      
Request throughput (req/s):              0.24      
Input token throughput (tok/s):          24286.16  
Output token throughput (tok/s):         242.86    
Peak output token throughput (tok/s):    256.00    
Peak concurrent requests:                8         
Total token throughput (tok/s):          24529.03  
Concurrency:                             7.95      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   32753.62  
Median E2E Latency (ms):                 32790.75  
P90 E2E Latency (ms):                    32898.65  
P99 E2E Latency (ms):                    32909.07  
---------------Time to First Token----------------
Mean TTFT (ms):                          1173.69   
Median TTFT (ms):                        1272.76   
P99 TTFT (ms):                           1405.30   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.61     
Median TPOT (ms):                        31.56     
P99 TPOT (ms):                           32.16     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           31.61     
Median ITL (ms):                         31.59     
P95 ITL (ms):                            32.27     
P99 ITL (ms):                            32.56     
Max ITL (ms):                            935.99    
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:32<03:47, 32.50s/it]
 38%|███▊      | 3/8 [00:32<00:42,  8.50s/it]
 62%|██████▎   | 5/8 [00:32<00:12,  4.16s/it]
100%|██████████| 8/8 [00:32<00:00,  4.11s/it]